node-mongo/node_mongo_post_1000.yml
---
services:
- module: monitoring
  ^local:
  server-agent:
  - address: node:4444
    logging: True
    metrics:
    - cpu
    - memory
    - network
execution:
- executor: jmeter 
  concurrency: 1000
  ramp-up: 1m
  hold-for: 2m
  scenario:
    requests:
    - url: http://node:3000/people
      method: POST
      headers:
        Content-Type: application/json
      body: '{"firstName": "John", "lastName": "Smith", "email": "john.smith@email.com"}'